load-tests/results/high-traffic-20260906-avail-500x500/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m02.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
high_traffic_booking   [   0% ] 500 VUs  00m00.8s/10m0s  000/500 shared iters

running (00m03.9s), 368/500 VUs, 132 complete and 0 interrupted iterations
high_traffic_booking   [  26% ] 500 VUs  00m01.8s/10m0s  132/500 shared iters

running (00m04.9s), 196/500 VUs, 304 complete and 0 interrupted iterations
high_traffic_booking   [  61% ] 500 VUs  00m02.8s/10m0s  304/500 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 998     177.23032/s
    checks_succeeded...: 100.00% 998 out of 998
    checks_failed......: 0.00%   0 out of 998

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 1      0.177585/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 499    88.61516/s
    reservations_created...............: 499    88.61516/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=2.23s min=654.91ms med=2.34s p(90)=3.24s p(95)=3.29s p(99)=3.39s max=3.43s

    HTTP
    http_req_duration..................: avg=2.22s min=330.54ms med=2.33s p(90)=3.24s p(95)=3.29s p(99)=3.39s max=3.43s
      { expected_response:true }.......: avg=2.22s min=330.54ms med=2.33s p(90)=3.24s p(95)=3.29s p(99)=3.39s max=3.43s
    http_req_failed....................: 0.19%  1 out of 503
    http_reqs..........................: 503    89.325502/s

    EXECUTION
    iteration_duration.................: avg=2.27s min=656.11ms med=2.37s p(90)=3.28s p(95)=3.34s p(99)=3.45s max=3.5s 
    iterations.........................: 500    88.792746/s
    vus................................: 196    min=0        max=500
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 389 kB 69 kB/s
    data_sent..........................: 291 kB 52 kB/s



running (00m05.6s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m03.5s/10m0s  500/500 shared iters